In [1]:
import pandas as pd

In [3]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index=['a', 'b', 'c', 'd'])

In [4]:
data['b']

0.5

In [5]:
'a' in data

True

In [6]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
data.items()

In [9]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [10]:
data['e'] = 1.25

In [11]:
data['a': 'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [12]:
data[0:2]

a    0.25
b    0.50
dtype: float64

In [13]:
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [14]:
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [15]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])

In [16]:
data[1]

'a'

In [17]:
data[1:3]

3    b
5    c
dtype: object

In [18]:
data.loc[1]

'a'

In [19]:
data.loc[1:3]

1    a
3    b
dtype: object

In [20]:
data.iloc[1]

'b'

In [23]:
area = pd.Series({
    'California': 423967,
    'Texas': 695662,
    'New York': 141297,
    'Florida': 170312,
    'Illinois': 149995
})
pop = pd.Series({
    'Californa': 38332521,
    'Texas': 26448193,
    'New York': 19651127,
    'Florida': 19552860,
    'Illinois': 12882135
})
data = pd.DataFrame({'area': area, 'pop': pop})
data

                area         pop
Californa        NaN  38332521.0
California  423967.0         NaN
Florida     170312.0  19552860.0
Illinois    149995.0  12882135.0
New York    141297.0  19651127.0
Texas       695662.0  26448193.0

In [24]:
data['area']

Californa          NaN
California    423967.0
Florida       170312.0
Illinois      149995.0
New York      141297.0
Texas         695662.0
Name: area, dtype: float64

In [27]:
data.area is data['area']

True

In [28]:
data.area

Californa          NaN
California    423967.0
Florida       170312.0
Illinois      149995.0
New York      141297.0
Texas         695662.0
Name: area, dtype: float64

In [29]:
data['density'] = data['pop'] / data['area']

In [30]:
data

                area         pop     density
Californa        NaN  38332521.0         NaN
California  423967.0         NaN         NaN
Florida     170312.0  19552860.0  114.806121
Illinois    149995.0  12882135.0   85.883763
New York    141297.0  19651127.0  139.076746
Texas       695662.0  26448193.0   38.018740

In [31]:
data.values

array([[           nan, 3.83325210e+07,            nan],
       [4.23967000e+05,            nan,            nan],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01]])

In [32]:
data.index

Index(['Californa', 'California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [33]:
data.T

,Californa,California,Florida,Illinois,New York,Texas
area,NaN,423967.0,1.703120e+05,1.499950e+05,1.412970e+05,6.956620e+05
pop,38332521.0,NaN,1.955286e+07,1.288214e+07,1.965113e+07,2.644819e+07
density,NaN,NaN,1.148061e+02,8.588376e+01,1.390767e+02,3.801874e+01

In [34]:
data.values[0]

array([      nan, 38332521.,       nan])

In [35]:
data['area']

Californa          NaN
California    423967.0
Florida       170312.0
Illinois      149995.0
New York      141297.0
Texas         695662.0
Name: area, dtype: float64

In [36]:
data.iloc[:3, :2]

                area         pop
Californa        NaN  38332521.0
California  423967.0         NaN
Florida     170312.0  19552860.0

In [37]:
data.loc[:'Illinois', :'pop']

                area         pop
Californa        NaN  38332521.0
California  423967.0         NaN
Florida     170312.0  19552860.0
Illinois    149995.0  12882135.0

In [39]:
data.loc[data.density > 100, ['pop', 'density']]

                 pop     density
Florida   19552860.0  114.806121
New York  19651127.0  139.076746

In [40]:
data.density > 100

Californa     False
California    False
Florida        True
Illinois      False
New York       True
Texas         False
Name: density, dtype: bool

In [41]:
data.iloc[0, 2] = 90

In [42]:
data['Florida': 'Illinois']

              area         pop     density
Florida   170312.0  19552860.0  114.806121
Illinois  149995.0  12882135.0   85.883763

In [43]:
data[1:3]

                area         pop     density
California  423967.0         NaN         NaN
Florida     170312.0  19552860.0  114.806121

In [44]:
data[data.density > 100]

              area         pop     density
Florida   170312.0  19552860.0  114.806121
New York  141297.0  19651127.0  139.076746